React_Module_Scripts/React_Employee_Modify_Put/absenceAPI_smoke.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  iterations: 1429
  scenario: SC03_React_Modify_Employee_Put

scenarios:
  SC03_React_Modify_Employee_Put:
    script: SC03_React_Modify_Employee_Put.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed